%文件名:zigzag.m
%程序员:郭迟
%编写时间:2004.2.12
%函数功能:本函数将完成对输入的8*8矩阵按照zigzag排列抽取数据.
%输入格式举例:zigdone=zigzag(A,1)
%参数说明:
%matrix为输入矩阵
%selcet=1为正变换,selcet=2为反变换
%zigdone为输出矩阵
function zigdone=zigzag(matrix,select);
if select==1
row=[1	1	2	3	2	1	1	2
     3	4	5	4	3	2	1	1
     2	3	4	5	6	7	6	5
     4	3	2	1	1	2	3	4
     5	6	7	8	8	7	6	5
     4	3	2	3	4	5	6	7
     8	8	7	6	5	4	5	6
     7	8	8	7	6	7	8	8];

 col=[1	2	1	1	2	3	4	3
      2	1	1	2	3	4	5	6
      5	4	3	2	1	1	2	3
      4	5	6	7	8	7	6	5
      4	3	2	1	2	3	4	5
      6	7	8	8	7	6	5	4
      3	4	5	6	7	8	8	7
      6	5	6	7	8	8	7	8];
end
if select==2;
row=[1	1	1	1	2	2	4	4
     1	1	1	2	3	4	4	6
     1	2	2	3	4	4	6	6
     2	2	3	4	4	6	6	7
     2	3	3	5	5	6	7	7
     3	3	5	5	6	7	7	8
     3	5	5	6	7	8	8	8
     5	5	7	7	8	8	8	8];
 
 col=[1	2	6	7	7	8	4	5
      3	5	8	6	1	3	6	3
      4	1	5	2	2	7	2	4
      2	4	3	1	8	1	5	6
      3	4	8	1	8	6	5	7
      5	7	2	7	7	4	8	5
      6	3	6	8	3	1	4	6
      4	5	1	2	2	3	7	8];
end


zigdone=zeros(8);
for i=1:8
    for j=1:8
       zigdone(i,j)=matrix(row(i,j),col(i,j));
     end
end